probonopd/Synth_Dexed/esp32/main/esp32_midi.cpp
/*
 * FMRack ESP32-S3 Port - MIDI Input Implementation
 *
 * Three MIDI input paths:
 *
 * 1. Hardware UART MIDI (31250 baud, standard DIN-5 via optocoupler)
 *    - Classic 5-pin DIN MIDI input, parsed byte-by-byte
 *    - Running status supported
 *    - SysEx buffered up to 4 KB (enough for DX7 32-voice bulk dumps)
 *
 * 2. USB Host MIDI (ESP32-S3 USB OTG in Host mode, GPIO19/20)
 *    - Plug a class-compliant USB-MIDI keyboard directly into the USB port
 *    - ESP32 acts as the USB host -- enumerates and reads from the device
 *    - Supports hot-plug: connect/disconnect at any time
 *
 * 3. UDP MIDI over Wi-Fi (handled in esp32_wifi.cpp)
 *
 * MIDI routing: all three sources feed into the same FMRack engine
 * via fmrack_handle_midi() / fmrack_handle_sysex().
 */

#include "esp32_midi.h"
#include "esp32_config.h"
#include "dexed_raw.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "driver/uart.h"
#include "esp_log.h"

#include <string.h>

/* ---------- USB Host MIDI ---------- */
#if FMRACK_MIDI_USB_ENABLE
#include "usb/usb_host.h"
#endif

static const char *TAG = "dexed_midi";

#if FMRACK_MIDI_USB_ENABLE
static void usb_log_event_flags(uint32_t event_flags)
{
    if (event_flags == 0) {
        return;
    }

    ESP_LOGI(TAG, "USB Host lib event flags: 0x%08lx%s%s",
             (unsigned long)event_flags,
             (event_flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS) ? " NO_CLIENTS" : "",
             (event_flags & USB_HOST_LIB_EVENT_FLAGS_ALL_FREE) ? " ALL_FREE" : "");
}
#endif

// Task handles
static TaskHandle_t s_midi_uart_task = NULL;
static volatile bool s_midi_running = false;

// SysEx buffer (max 4 KB for bulk dumps)
#define SYSEX_BUF_SIZE 4200
static uint8_t s_sysex_buf[SYSEX_BUF_SIZE];
static int s_sysex_len = 0;
static bool s_in_sysex = false;

// Separate SysEx state for USB-MIDI
#if FMRACK_MIDI_USB_ENABLE
static uint8_t s_usb_sysex_buf[SYSEX_BUF_SIZE];
static int s_usb_sysex_len = 0;
#endif

/* ================================================
 * MIDI byte-stream parser (for UART input)
 * ================================================ */

static int midi_msg_len(uint8_t status)
{
    switch (status & 0xF0) {
        case 0x80: return 2;  // Note Off
        case 0x90: return 2;  // Note On
        case 0xA0: return 2;  // Polyphonic Aftertouch
        case 0xB0: return 2;  // Control Change
        case 0xC0: return 1;  // Program Change
        case 0xD0: return 1;  // Channel Aftertouch
        case 0xE0: return 2;  // Pitch Bend
        default:   return 0;
    }
}

typedef struct {
    uint8_t status;
    uint8_t data[2];
    int     data_count;
    int     data_needed;
} midi_parser_t;

static void midi_parser_init(midi_parser_t *p)
{
    memset(p, 0, sizeof(*p));
}

static void midi_parser_process_byte(midi_parser_t *p, uint8_t byte)
{
    // Handle SysEx
    if (s_in_sysex) {
        if (s_sysex_len < SYSEX_BUF_SIZE) {
            s_sysex_buf[s_sysex_len++] = byte;
        }
        if (byte == 0xF7) {
            if (s_sysex_len >= 2) {
                uint8_t sysex_channel = 0;
                if (s_sysex_len > 2 && s_sysex_buf[1] == 0x43) {
                    sysex_channel = (s_sysex_buf[2] & 0x0F) + 1;
                }
                dexed_raw_handle_sysex(s_sysex_buf, s_sysex_len, sysex_channel);
            }
            s_in_sysex = false;
            s_sysex_len = 0;
        }
        return;
    }

    if (byte == 0xF0) {
        s_in_sysex = true;
        s_sysex_len = 0;
        s_sysex_buf[s_sysex_len++] = byte;
        return;
    }

    if (byte >= 0xF8) return;  // Real-time: ignore

    if (byte >= 0xF1 && byte <= 0xF7) {
        p->status = 0;
        p->data_count = 0;
        return;
    }

    if (byte & 0x80) {
        p->status = byte;
        p->data_count = 0;
        p->data_needed = midi_msg_len(byte);
        return;
    }

    if (p->status == 0) return;

    p->data[p->data_count++] = byte;

    if (p->data_count >= p->data_needed) {
        if (p->data_needed == 2) {
            dexed_raw_handle_midi(p->status, p->data[0], p->data[1]);
        } else if (p->data_needed == 1) {
            dexed_raw_handle_midi(p->status, p->data[0], 0);
        }
        p->data_count = 0;
    }
}

/* ================================================
 * Hardware UART MIDI task
 * ================================================ */

static void midi_uart_task(void *param)
{
    ESP_LOGI(TAG, "MIDI UART task started on core %d (UART%d, RX pin %d)",
             xPortGetCoreID(), FMRACK_MIDI_UART_NUM, FMRACK_MIDI_RX_PIN);

    midi_parser_t parser;
    midi_parser_init(&parser);

    uint8_t buf[64];

    while (s_midi_running) {
        int len = uart_read_bytes((uart_port_t)FMRACK_MIDI_UART_NUM,
                                   buf, sizeof(buf), pdMS_TO_TICKS(1));
        if (len > 0) {
            for (int i = 0; i < len; i++) {
                midi_parser_process_byte(&parser, buf[i]);
            }
        }
    }

    ESP_LOGI(TAG, "MIDI UART task exiting");
    vTaskDelete(NULL);
}

/* ================================================
 * USB Host MIDI (ESP32-S3 as USB host, reads from
 * an attached USB-MIDI keyboard/controller)
 * ================================================ */

#if FMRACK_MIDI_USB_ENABLE

/* USB Audio / MIDI class constants */
#define USB_CLASS_AUDIO             0x01
#define USB_SUBCLASS_MIDI_STREAMING 0x03

/* Transfer buffer size (multiple of 64-byte MPS) */
#define MIDI_USB_XFER_BUF_SIZE     64

/* State for one connected MIDI device */
typedef struct {
    usb_device_handle_t dev_hdl;
    uint8_t midi_intf_num;
    uint8_t ep_in;                  /* Bulk IN endpoint address */
    uint8_t ep_out;                 /* Bulk OUT endpoint address (optional) */
    uint16_t ep_in_mps;            /* Max packet size */
    usb_transfer_t *xfer_in;       /* Persistent IN transfer */
    bool connected;
} midi_device_t;

static midi_device_t s_midi_dev = {};
static usb_host_client_handle_t s_client_hdl = NULL;
static volatile bool s_usb_host_running = false;
static TaskHandle_t s_usb_host_lib_task = NULL;
static TaskHandle_t s_midi_host_task_hdl = NULL;

/* Set by midi_transfer_cb; resubmit happens in midi_host_task to keep the
 * callback short and decouple USB DMA scheduling from the ISR context. */
static volatile bool s_xfer_needs_resubmit = false;

/* Action flags set from callbacks, processed in main loop */
#define MIDI_HOST_ACTION_OPEN  (1 << 0)
#define MIDI_HOST_ACTION_CLOSE (1 << 1)
static volatile uint32_t s_actions = 0;
static volatile uint8_t s_new_dev_addr = 0;

/* ----------------------------------------------------------------
 * USB-MIDI packet parser (4-byte USB-MIDI event packets -> engine)
 * ---------------------------------------------------------------- */
static void usb_midi_process_sysex_continue(const uint8_t *data, int count)
{
    for (int i = 0; i < count; i++) {
        if (s_usb_sysex_len < SYSEX_BUF_SIZE)
            s_usb_sysex_buf[s_usb_sysex_len++] = data[i];
    }
}

static void usb_midi_finish_sysex(const uint8_t *data, int count)
{
    for (int i = 0; i < count; i++) {
        if (s_usb_sysex_len < SYSEX_BUF_SIZE)
            s_usb_sysex_buf[s_usb_sysex_len++] = data[i];
    }
    if (s_usb_sysex_len >= 2) {
        uint8_t ch = 0;
        if (s_usb_sysex_len > 2 && s_usb_sysex_buf[1] == 0x43)
            ch = (s_usb_sysex_buf[2] & 0x0F) + 1;
        dexed_raw_handle_sysex(s_usb_sysex_buf, s_usb_sysex_len, ch);
    }
    s_usb_sysex_len = 0;
}

