probonopd/Synth_Dexed/esp32/main/esp32_midi.cpp
static void usb_midi_process_packet(const uint8_t *pkt)
{
    uint8_t cin = pkt[0] & 0x0F;
    uint8_t b0  = pkt[1];
    uint8_t b1  = pkt[2];
    uint8_t b2  = pkt[3];

    switch (cin) {
        /* 3-byte channel messages */
        case 0x08: /* Note Off */
        case 0x09: /* Note On */
        case 0x0A: /* Poly Aftertouch */
        case 0x0B: /* Control Change */
        case 0x0E: /* Pitch Bend */
            dexed_raw_handle_midi(b0, b1, b2);
            break;

        /* 2-byte channel messages */
        case 0x0C: /* Program Change */
        case 0x0D: /* Channel Aftertouch */
            dexed_raw_handle_midi(b0, b1, 0);
            break;

        /* SysEx start / continue -- 3 data bytes */
        case 0x04:
            usb_midi_process_sysex_continue(&pkt[1], 3);
            break;

        /* SysEx end with 1 byte */
        case 0x05:
            usb_midi_finish_sysex(&pkt[1], 1);
            break;

        /* SysEx end with 2 bytes */
        case 0x06:
            usb_midi_finish_sysex(&pkt[1], 2);
            break;

        /* SysEx end with 3 bytes */
        case 0x07:
            usb_midi_finish_sysex(&pkt[1], 3);
            break;

        default:
            break;
    }
}

/* ----------------------------------------------------------------
 * Descriptor walking: find MIDI Streaming interface + Bulk IN EP
 * ---------------------------------------------------------------- */
static bool find_midi_interface(usb_device_handle_t dev_hdl, midi_device_t *midi)
{
    const usb_config_desc_t *config_desc = NULL;
    esp_err_t err = usb_host_get_active_config_descriptor(dev_hdl, &config_desc);
    if (err != ESP_OK || config_desc == NULL) {
        ESP_LOGE(TAG, "Failed to get config descriptor: %s", esp_err_to_name(err));
        return false;
    }

    ESP_LOGI(TAG, "Walking descriptors: wTotalLength=%d, looking for Audio/MIDI Streaming (class=1 subclass=3)...",
             config_desc->wTotalLength);

    int offset = 0;
    const usb_standard_desc_t *cur_desc = (const usb_standard_desc_t *)config_desc;
    uint16_t wTotalLength = config_desc->wTotalLength;
    int desc_count = 0;

    while (cur_desc != NULL) {
        desc_count++;
        ESP_LOGD(TAG, "  Descriptor #%d: type=0x%02X len=%d",
                 desc_count, cur_desc->bDescriptorType, cur_desc->bLength);

        if (cur_desc->bDescriptorType == USB_B_DESCRIPTOR_TYPE_INTERFACE) {
            const usb_intf_desc_t *intf = (const usb_intf_desc_t *)cur_desc;

            if (intf->bInterfaceClass == USB_CLASS_AUDIO &&
                intf->bInterfaceSubClass == USB_SUBCLASS_MIDI_STREAMING) {

                ESP_LOGI(TAG, "Found MIDI Streaming interface %d (%d endpoints)",
                         intf->bInterfaceNumber, intf->bNumEndpoints);

                midi->midi_intf_num = intf->bInterfaceNumber;

                /* Walk endpoints within this interface */
                for (int ep_idx = 0; ep_idx < intf->bNumEndpoints; ep_idx++) {
                    int ep_offset = offset;
                    const usb_ep_desc_t *ep =
                        usb_parse_endpoint_descriptor_by_index(
                            intf, ep_idx, wTotalLength, &ep_offset);

                    if (ep == NULL) continue;

                    if (USB_EP_DESC_GET_XFERTYPE(ep) == USB_TRANSFER_TYPE_BULK) {
                        if (USB_EP_DESC_GET_EP_DIR(ep)) {
                            /* IN endpoint (device -> host = MIDI input) */
                            midi->ep_in = ep->bEndpointAddress;
                            midi->ep_in_mps = USB_EP_DESC_GET_MPS(ep);
                            ESP_LOGI(TAG, "  Bulk IN  EP 0x%02X (MPS=%d)",
                                     midi->ep_in, midi->ep_in_mps);
                        } else {
                            /* OUT endpoint (host -> device) */
                            midi->ep_out = ep->bEndpointAddress;
                            ESP_LOGI(TAG, "  Bulk OUT EP 0x%02X", midi->ep_out);
                        }
                    }
                }
                return (midi->ep_in != 0);
            }
        }
        cur_desc = usb_parse_next_descriptor(cur_desc, wTotalLength, &offset);
    }

    ESP_LOGW(TAG, "No MIDI Streaming interface found after scanning %d descriptors", desc_count);
    return false;
}

/* ----------------------------------------------------------------
 * Bulk IN transfer callback -- called from usb_host_client_handle_events()
 * ---------------------------------------------------------------- */
static void midi_transfer_cb(usb_transfer_t *transfer)
{
    if (transfer->status == USB_TRANSFER_STATUS_COMPLETED) {
        int num_bytes = transfer->actual_num_bytes;
        uint8_t *data = transfer->data_buffer;

        if (num_bytes > 0) {
            ESP_LOGD(TAG, "USB MIDI IN: %d bytes", num_bytes);
            /* Log raw data at debug level for first few bytes */
            if (num_bytes <= 16) {
                ESP_LOG_BUFFER_HEX_LEVEL(TAG, data, num_bytes, ESP_LOG_DEBUG);
            }
        }

        /* Process 4-byte USB-MIDI packets */
        for (int i = 0; i + 3 < num_bytes; i += 4) {
            /* Skip padding packets (all zeros) */
            if (data[i] == 0 && data[i+1] == 0 && data[i+2] == 0 && data[i+3] == 0)
                continue;
            ESP_LOGV(TAG, "MIDI pkt: [%02X %02X %02X %02X]",
                     data[i], data[i+1], data[i+2], data[i+3]);
            usb_midi_process_packet(&data[i]);
        }
    } else if (transfer->status == USB_TRANSFER_STATUS_NO_DEVICE) {
        ESP_LOGW(TAG, "USB MIDI device disconnected during transfer");
        return; /* Don't resubmit */
    } else {
        ESP_LOGW(TAG, "USB MIDI transfer status: %d", transfer->status);
    }

    /* Signal the host task to resubmit.  Do NOT call usb_host_transfer_submit
     * here: doing so inside the callback (which executes synchronously inside
     * usb_host_client_handle_events) causes the very next completion callback
     * to fire before the event-handling loop can yield, starving Core-0 tasks
     * and generating burst USB DMA traffic that contends with I2S DMA. */
    if (s_midi_dev.connected) {
        s_xfer_needs_resubmit = true;
    }
}

/* ----------------------------------------------------------------
 * Open / close MIDI device
 * ---------------------------------------------------------------- */
static void close_midi_device(void); /* forward declaration */
static void open_midi_device(uint8_t dev_addr)
{
    ESP_LOGI(TAG, "Opening USB device at address %d...", dev_addr);
    int step = 0; // debug step counter

    usb_device_handle_t dev_hdl = NULL;
    esp_err_t err = usb_host_device_open(s_client_hdl, dev_addr, &dev_hdl);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Step %d: Failed to open device %d: %s", step, dev_addr, esp_err_to_name(err));
        return;
    }
    ESP_LOGI(TAG, "Step %d: Device %d opened successfully", step, dev_addr);
    step++;

