probonopd/Synth_Dexed/esp32/main/esp32_midi.cpp
    /* Log device info */
    const usb_device_desc_t *dev_desc = NULL;
    usb_host_get_device_descriptor(dev_hdl, &dev_desc);
    if (dev_desc) {
        ESP_LOGI(TAG, "USB device descriptor:");
        ESP_LOGI(TAG, "  VID=0x%04X PID=0x%04X",
                 dev_desc->idVendor, dev_desc->idProduct);
        ESP_LOGI(TAG, "  bDeviceClass=%d bDeviceSubClass=%d bDeviceProtocol=%d",
                 dev_desc->bDeviceClass, dev_desc->bDeviceSubClass,
                 dev_desc->bDeviceProtocol);
        ESP_LOGI(TAG, "  bNumConfigurations=%d", dev_desc->bNumConfigurations);
    } else {
        ESP_LOGW(TAG, "Could not get device descriptor!");
    }

    /* Log config descriptor */
    const usb_config_desc_t *config_desc = NULL;
    err = usb_host_get_active_config_descriptor(dev_hdl, &config_desc);
    if (err == ESP_OK && config_desc) {
        ESP_LOGI(TAG, "Step %d: Config descriptor: wTotalLength=%d bNumInterfaces=%d",
                 step, config_desc->wTotalLength, config_desc->bNumInterfaces);
        step++;

        /* Dump all interface descriptors for diagnostics */
        int offset = 0;
        const usb_standard_desc_t *desc = (const usb_standard_desc_t *)config_desc;
        uint16_t wTotal = config_desc->wTotalLength;
        while (desc != NULL) {
            if (desc->bDescriptorType == USB_B_DESCRIPTOR_TYPE_INTERFACE) {
                const usb_intf_desc_t *intf = (const usb_intf_desc_t *)desc;
                ESP_LOGI(TAG, "  Interface %d: class=%d subclass=%d protocol=%d eps=%d",
                         intf->bInterfaceNumber, intf->bInterfaceClass,
                         intf->bInterfaceSubClass, intf->bInterfaceProtocol,
                         intf->bNumEndpoints);
            }
            desc = usb_parse_next_descriptor(desc, wTotal, &offset);
        }
    } else {
        ESP_LOGW(TAG, "Could not get config descriptor: %s", esp_err_to_name(err));
    }

    /* Scan using a local temporary struct so we never clobber s_midi_dev if
     * this device turns out to have no MIDI interface.  The previous approach
     * (memset s_midi_dev here) caused a handle leak: if the startup scan
     * already connected the keyboard and a concurrent NEW_DEV for the USB
     * audio device triggered another open_midi_device() call, the memset
     * would zero s_midi_dev.dev_hdl without calling usb_host_device_close().
     * The USB host library kept the handle open, so every later attempt to
     * re-open the keyboard returned ESP_ERR_INVALID_STATE. */
    midi_device_t scan_dev = {};
    if (!find_midi_interface(dev_hdl, &scan_dev)) {
        ESP_LOGW(TAG, "Step %d: Device %d has no MIDI Streaming interface (class=1 subclass=3), closing", step, dev_addr);
        usb_host_device_close(s_client_hdl, dev_hdl);
        return;
    }
    ESP_LOGI(TAG, "Step %d: Found MIDI interface", step);
    step++;

    /* If there is an existing (leaked) device handle from a previous failed
     * open, close it now before taking ownership of the new device. */
    if (s_midi_dev.dev_hdl != NULL) {
        ESP_LOGW(TAG, "Closing leaked previous MIDI device handle before opening new one");
        close_midi_device();
    }

    /* Copy scan results and take ownership of dev_hdl. */
    s_midi_dev = scan_dev;
    s_midi_dev.dev_hdl = dev_hdl;

    /* Claim the MIDI Streaming interface */
    err = usb_host_interface_claim(s_client_hdl, dev_hdl,
                                    s_midi_dev.midi_intf_num, 0);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Step %d: Failed to claim interface %d: %s",
                 step, s_midi_dev.midi_intf_num, esp_err_to_name(err));
        usb_host_device_close(s_client_hdl, dev_hdl);
        memset(&s_midi_dev, 0, sizeof(s_midi_dev));
        return;
    }
    ESP_LOGI(TAG, "Step %d: Interface claimed", step);
    step++;

    /* Allocate Bulk IN transfer */
    size_t buf_size = (size_t)usb_round_up_to_mps(
        MIDI_USB_XFER_BUF_SIZE, (int)s_midi_dev.ep_in_mps);
    err = usb_host_transfer_alloc(buf_size, 0, &s_midi_dev.xfer_in);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to alloc IN transfer: %s", esp_err_to_name(err));
        usb_host_interface_release(s_client_hdl, dev_hdl, s_midi_dev.midi_intf_num);
        usb_host_device_close(s_client_hdl, dev_hdl);
        memset(&s_midi_dev, 0, sizeof(s_midi_dev));
        return;
    }
    /* Optionally allocate an internal RAM buffer and keep the original PSRAM
       buffer as a harmless leak.  Having the buffer in internal RAM reduces
       PSRAM contention during USB DMA; the leak is only one buffer per device
       and is small (~64 bytes). */
    void *int_buf = heap_caps_malloc(buf_size, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA | MALLOC_CAP_CACHE_ALIGNED);
    if (int_buf) {
        void **bufptr = (void **)&s_midi_dev.xfer_in->data_buffer;
        *bufptr = int_buf;
        size_t *szptr = (size_t *)&s_midi_dev.xfer_in->data_buffer_size;
        *szptr = heap_caps_get_allocated_size(int_buf);
    } else {
        ESP_LOGW(TAG, "Internal RAM allocation failed, using PSRAM buffer");
    }

    s_midi_dev.xfer_in->device_handle = dev_hdl;
    s_midi_dev.xfer_in->bEndpointAddress = s_midi_dev.ep_in;
    s_midi_dev.xfer_in->callback = midi_transfer_cb;
    s_midi_dev.xfer_in->context = &s_midi_dev;
    s_midi_dev.xfer_in->num_bytes = buf_size;

    s_midi_dev.connected = true;

    /* Submit first IN transfer -- starts continuous MIDI reading */
    err = usb_host_transfer_submit(s_midi_dev.xfer_in);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Step %d: Failed to submit initial IN transfer: %s",
                 step, esp_err_to_name(err));
        s_midi_dev.connected = false;
        usb_host_transfer_free(s_midi_dev.xfer_in);
        usb_host_interface_release(s_client_hdl, dev_hdl, s_midi_dev.midi_intf_num);
        usb_host_device_close(s_client_hdl, dev_hdl);
        memset(&s_midi_dev, 0, sizeof(s_midi_dev));
        return;
    }
    ESP_LOGI(TAG, "Step %d: Initial transfer submitted", step);
    step++;

    ESP_LOGI(TAG, "USB MIDI keyboard connected -- streaming from EP 0x%02X",
             s_midi_dev.ep_in);
}

static void close_midi_device(void)
{
    if (!s_midi_dev.dev_hdl) return;

    s_midi_dev.connected = false;

    usb_host_interface_release(s_client_hdl, s_midi_dev.dev_hdl,
                                s_midi_dev.midi_intf_num);

