probonopd/Synth_Dexed/esp32/main/esp32_midi.cpp
    if (s_midi_dev.xfer_in) {
        usb_host_transfer_free(s_midi_dev.xfer_in);
        s_midi_dev.xfer_in = NULL;
    }

    usb_host_device_close(s_client_hdl, s_midi_dev.dev_hdl);
    memset(&s_midi_dev, 0, sizeof(s_midi_dev));

    ESP_LOGI(TAG, "USB MIDI keyboard disconnected");
}

/* ----------------------------------------------------------------
 * Client event callback -- called asynchronously
 * ---------------------------------------------------------------- */
static void client_event_cb(const usb_host_client_event_msg_t *event_msg, void *arg)
{
    ESP_LOGD(TAG, "USB client event: %d", event_msg->event);
    switch (event_msg->event) {
        case USB_HOST_CLIENT_EVENT_NEW_DEV:
            ESP_LOGI(TAG, ">>> New USB device at address %d",
                     event_msg->new_dev.address);
            s_new_dev_addr = event_msg->new_dev.address;
            s_actions |= MIDI_HOST_ACTION_OPEN;
            break;
        case USB_HOST_CLIENT_EVENT_DEV_GONE:
            /* Only close if the device that left is the one we opened.
             * DEV_GONE fires for ALL device removals (any client), not just
             * for devices this client has open.  Ignoring foreign DEV_GONE
             * events prevents the MIDI connection from being torn down when
             * an unrelated device (e.g. the USB audio output device) changes
             * state. */
            if (s_midi_dev.dev_hdl != NULL &&
                    event_msg->dev_gone.dev_hdl == s_midi_dev.dev_hdl) {
                ESP_LOGI(TAG, ">>> USB MIDI device gone");
                s_actions |= MIDI_HOST_ACTION_CLOSE;
            } else {
                ESP_LOGD(TAG, ">>> USB device gone (not our MIDI device, ignoring)");
            }
            break;
        default:
            ESP_LOGD(TAG, ">>> Unknown USB client event: %d", event_msg->event);
            break;
    }
}

/* ----------------------------------------------------------------
 * USB Host Library daemon task (handles enumeration, hub events)
 * ---------------------------------------------------------------- */
static void usb_host_lib_task(void *arg)
{
    ESP_LOGI(TAG, "USB Host lib task starting on core %d...", xPortGetCoreID());

    usb_host_config_t host_config = {
        .skip_phy_setup = false,
        // Keep root port powered immediately.  Power-cycling while a keyboard
        // is attached has been observed to cause enumeration failures
        // (CHECK_SHORT_DEV_DESC).  Let the USB host driver handle power itself.
        .root_port_unpowered = false,
        .intr_flags = ESP_INTR_FLAG_LEVEL2,
        .enum_filter_cb = NULL,
    };
    esp_err_t err = usb_host_install(&host_config);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "USB Host install failed: %s", esp_err_to_name(err));
        vTaskDelete(NULL);
        return;
    }

    /* Signal the caller that host lib is ready BEFORE entering the event loop.
     * The previous code had a 2-second vTaskDelay() here, which prevented
     * usb_host_lib_handle_events() from running during that window.  This
     * blocked hub and device enumeration, so NEW_DEV events were never fired.
     * Signal immediately and let the event loop below drive enumeration. */
    xTaskNotifyGive((TaskHandle_t)arg);

    ESP_LOGI(TAG, "USB Host Library installed -- daemon running on core %d", xPortGetCoreID());

    while (s_usb_host_running) {
        uint32_t event_flags = 0;
        err = usb_host_lib_handle_events(pdMS_TO_TICKS(200), &event_flags);
        if (err == ESP_OK) {
            usb_log_event_flags(event_flags);
            if (event_flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS) {
                ESP_LOGW(TAG, "USB Host: no clients, freeing all devices");
                usb_host_device_free_all();
            }
        } else if (err != ESP_ERR_TIMEOUT) {
            ESP_LOGW(TAG, "USB Host lib_handle_events error: %s", esp_err_to_name(err));
        }
    }

    /* Clean up */
    usb_host_uninstall();
    ESP_LOGI(TAG, "USB Host Library uninstalled");
    vTaskDelete(NULL);
}

/* ----------------------------------------------------------------
 * MIDI Host client task (registers client, opens devices, reads MIDI)
 * ---------------------------------------------------------------- */
static void midi_host_task(void *arg)
{
    usb_host_client_config_t client_config = {
        .is_synchronous = false,
        .max_num_event_msg = 5,
        .async = {
            .client_event_callback = client_event_cb,
            .callback_arg = NULL,
        },
    };
    esp_err_t err = usb_host_client_register(&client_config, &s_client_hdl);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "USB Host client register failed: %s", esp_err_to_name(err));
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI(TAG, "USB Host MIDI client registered on core %d -- waiting for keyboard...",
             xPortGetCoreID());

    /* Check for devices that were already enumerated before we registered.
     * This handles the case where the device was connected and enumerated
     * before the MIDI client task started (NEW_DEV would have been missed). */
    {
        uint8_t addr_list[16];
        int num_devs = 0;
        if (usb_host_device_addr_list_fill(sizeof(addr_list), addr_list, &num_devs) == ESP_OK
                && num_devs > 0) {
            ESP_LOGI(TAG, "Found %d already-enumerated device(s), trying to open as MIDI...",
                     num_devs);
            for (int i = 0; i < num_devs && !s_midi_dev.connected; i++) {
                ESP_LOGI(TAG, "  Trying device at address %d", addr_list[i]);
                open_midi_device(addr_list[i]);
            }
        }
    }

    uint32_t loop_count = 0;   /* heartbeat counter */
    uint32_t scan_count  = 0;  /* device-list scan counter (separate from heartbeat) */

    while (s_usb_host_running) {
        /* Process client events -- THIS dispatches transfer callbacks.
         * 5 ms timeout keeps the loop responsive without busy-spinning. */
        usb_host_client_handle_events(s_client_hdl, pdMS_TO_TICKS(5));

