probonopd/Synth_Dexed/esp32/main/esp32_midi.cpp
        /* Resubmit USB MIDI bulk-IN transfer.
         * Runs in the task loop (not the ISR callback) to avoid reentrancy
         * inside usb_host_client_handle_events.
         *
         * A 4 ms yield before resubmit throttles USB bulk-IN polling to
         * ~100 cycles/s (was 2 ms → ~125/s).  When WLAN is also active the
         * WiFi DMA and USB DMA together can saturate the AHB bus; reducing
         * USB resubmit frequency lowers bus pressure enough that I2S DMA
         * descriptor fetches are no longer starved.  MIDI input latency is
         * ≤ 9 ms — imperceptible to a player. */
        if (s_xfer_needs_resubmit && s_midi_dev.connected && s_midi_dev.xfer_in) {
            s_xfer_needs_resubmit = false;
            vTaskDelay(pdMS_TO_TICKS(4));
            esp_err_t sub_err = usb_host_transfer_submit(s_midi_dev.xfer_in);
            if (sub_err != ESP_OK && sub_err != ESP_ERR_NOT_FOUND) {
                ESP_LOGE(TAG, "Failed to resubmit MIDI IN transfer: %s",
                         esp_err_to_name(sub_err));
            }
        }

        /* Process actions from callbacks */
        if (s_actions & MIDI_HOST_ACTION_OPEN) {
            s_actions &= ~MIDI_HOST_ACTION_OPEN;
            /* Skip if already connected: when multiple NEW_DEV events arrive
             * in one handle_events() call, s_new_dev_addr holds the last
             * address and the earlier addresses (including the keyboard) are
             * lost.  Calling open_midi_device for a non-MIDI device while
             * already connected would previously clobber s_midi_dev.  With
             * the local-scan-dev fix this is now safe, but there is still no
             * point opening a new device when one is already working. */
            if (!s_midi_dev.connected) {
                ESP_LOGI(TAG, "MIDI client: processing OPEN action for addr %d", s_new_dev_addr);
                open_midi_device(s_new_dev_addr);
            } else {
                ESP_LOGD(TAG, "MIDI client: ignoring OPEN for addr %d (already connected)", s_new_dev_addr);
            }
        }
        if (s_actions & MIDI_HOST_ACTION_CLOSE) {
            s_actions &= ~MIDI_HOST_ACTION_CLOSE;
            ESP_LOGI(TAG, "MIDI client: processing CLOSE action");
            close_midi_device();
        }

        /* When not connected, periodically query the host stack for any
         * newly-enumerated devices.  This is the correct approach for hub-
         * attached keyboards: usb_host_device_addr_list_fill() returns the
         * addresses that the host stack has *actually enumerated*, unlike the
         * old 1-127 blind scan which called open() on non-existent addresses.
         * Check every ~1 s (200 loops × 5 ms). */
        if (!s_midi_dev.connected) {
            if (++scan_count >= 200) {
                scan_count = 0;
                uint8_t addr_list[16];
                int num_devs = 0;
                esp_err_t fill_err = usb_host_device_addr_list_fill(
                        sizeof(addr_list), addr_list, &num_devs);
                if (fill_err == ESP_OK && num_devs > 0) {
                    ESP_LOGI(TAG, "USB scan: %d device(s) enumerated, trying to open as MIDI...",
                             num_devs);
                    for (int i = 0; i < num_devs && !s_midi_dev.connected; i++) {
                        ESP_LOGI(TAG, "  Trying address %d", addr_list[i]);
                        open_midi_device(addr_list[i]);
                    }
                } else {
                    ESP_LOGD(TAG, "USB scan: no devices enumerated yet (err=%s)",
                             esp_err_to_name(fill_err));
                }
            }
        } else {
            scan_count = 0;  /* reset when connected so we react quickly on reconnect */
        }

        /* Periodic heartbeat every ~10 seconds (2000 × 5 ms) */
        if (++loop_count >= 2000) {
            loop_count = 0;
            ESP_LOGI(TAG, "USB MIDI client heartbeat: connected=%s actions=0x%lx",
                     s_midi_dev.connected ? "yes" : "no",
                     (unsigned long)s_actions);
        }
    }

    close_midi_device();
    usb_host_client_deregister(s_client_hdl);
    s_client_hdl = NULL;
    ESP_LOGI(TAG, "USB Host MIDI client deregistered");
    vTaskDelete(NULL);
}

/* ----------------------------------------------------------------
 * USB Host MIDI init / stop
 * ---------------------------------------------------------------- */
static int usb_midi_host_init(void)
{
    ESP_LOGI(TAG, "Initializing USB Host for MIDI keyboard input...");

    s_usb_host_running = true;

    /* Task 1: USB Host Library daemon.
     * Priority one below the MIDI client: the daemon mostly sleeps in
     * usb_host_lib_handle_events and does not need real-time scheduling.
     * Keeping it lower ensures the MIDI client (and audio stats task) are
     * not starved on Core 0 during device connect / disconnect churn. */
    BaseType_t ret = xTaskCreatePinnedToCore(
        usb_host_lib_task,
        "usb_host_lib",
        4096,
        xTaskGetCurrentTaskHandle(), /* pass our handle for notification */
        USB_MIDI_TASK_PRIORITY - 1,
        &s_usb_host_lib_task,
        USB_MIDI_TASK_CORE
    );
    if (ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create USB host lib task");
        s_usb_host_running = false;
        return -1;
    }

    /* Wait for host lib installation */
    if (ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(2000)) == 0) {
        ESP_LOGW(TAG, "Timeout waiting for USB Host Library installation (will continue)");
        // do not disable s_usb_host_running; the usb_host_lib_task will still install
        // and client task can be started regardless.
    }

    /* Task 2: MIDI Host client */
    ret = xTaskCreatePinnedToCore(
        midi_host_task,
        "midi_host",
        4096,
        NULL,
        USB_MIDI_TASK_PRIORITY,
        &s_midi_host_task_hdl,
        USB_MIDI_TASK_CORE
    );
    if (ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create MIDI host task");
        s_usb_host_running = false;
        return -1;
    }

    ESP_LOGI(TAG, "USB Host MIDI ready -- plug in a USB-MIDI keyboard on the USB port");
    return 0;
}

static void usb_midi_host_stop(void)
{
    s_usb_host_running = false;
    /* Tasks will exit on their own */
    vTaskDelay(pdMS_TO_TICKS(500));
    s_usb_host_lib_task = NULL;
    s_midi_host_task_hdl = NULL;
}

#endif /* FMRACK_MIDI_USB_ENABLE */

/* ================================================
 * Public API
 * ================================================ */

int esp32_midi_init(void)
{
    ESP_LOGI(TAG, "Initializing MIDI input...");

    // --- Hardware MIDI UART ---
    uart_config_t uart_config = {
        .baud_rate = MIDI_BAUD_RATE,
        .data_bits = UART_DATA_8_BITS,
        .parity    = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = 0,
        .source_clk = UART_SCLK_DEFAULT,
    };

    esp_err_t ret = uart_driver_install((uart_port_t)FMRACK_MIDI_UART_NUM,
                                         MIDI_UART_BUF_SIZE, 0, 0, NULL, 0);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to install UART%d driver: %s",
                 FMRACK_MIDI_UART_NUM, esp_err_to_name(ret));
        return -1;
    }

    ret = uart_param_config((uart_port_t)FMRACK_MIDI_UART_NUM, &uart_config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to configure UART%d: %s",
                 FMRACK_MIDI_UART_NUM, esp_err_to_name(ret));
        return -1;
    }

