probonopd/Synth_Dexed/esp32/main/esp32_midi.cpp
    ret = uart_set_pin((uart_port_t)FMRACK_MIDI_UART_NUM,
                        FMRACK_MIDI_TX_PIN, FMRACK_MIDI_RX_PIN,
                        UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set UART%d pins: %s",
                 FMRACK_MIDI_UART_NUM, esp_err_to_name(ret));
        return -1;
    }

    ESP_LOGI(TAG, "Hardware MIDI UART%d initialized (31250 baud, RX=%d, TX=%d)",
             FMRACK_MIDI_UART_NUM, FMRACK_MIDI_RX_PIN, FMRACK_MIDI_TX_PIN);

    // --- USB Host MIDI ---
#if FMRACK_MIDI_USB_ENABLE
    if (usb_midi_host_init() != 0) {
        ESP_LOGW(TAG, "USB Host MIDI init failed (non-fatal, continuing without USB)");
    }
#endif

    return 0;
}

int esp32_midi_start(void)
{
    if (s_midi_running) {
        ESP_LOGW(TAG, "MIDI tasks already running");
        return 0;
    }

    s_midi_running = true;

    // Start hardware MIDI task on core 0
    BaseType_t ret = xTaskCreatePinnedToCore(
        midi_uart_task,
        "midi_uart",
        MIDI_TASK_STACK_SIZE,
        NULL,
        MIDI_TASK_PRIORITY,
        &s_midi_uart_task,
        MIDI_TASK_CORE
    );
    if (ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create MIDI UART task");
        s_midi_running = false;
        return -1;
    }

    /* USB Host MIDI tasks are already running from esp32_midi_init() */

    ESP_LOGI(TAG, "MIDI input started (UART + USB Host on core %d)", MIDI_TASK_CORE);
    return 0;
}

void esp32_midi_stop(void)
{
    s_midi_running = false;

    if (s_midi_uart_task) {
        vTaskDelay(pdMS_TO_TICKS(50));
        s_midi_uart_task = NULL;
    }

#if FMRACK_MIDI_USB_ENABLE
    usb_midi_host_stop();
#endif

    uart_driver_delete((uart_port_t)FMRACK_MIDI_UART_NUM);

    ESP_LOGI(TAG, "MIDI input stopped");
}

bool esp32_midi_usb_connected(void)
{
#if FMRACK_MIDI_USB_ENABLE
    return s_midi_dev.connected;
#else
    return false;
#endif
}
